Revit 2027 API
BuiltInFailures.RebarFailures.RebarHooksDontMatchShape Property
 The Rebar's hooks do not match its Rebar Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarHooksDontMatchShape { get; }
Public Shared ReadOnly Property RebarHooksDontMatchShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarHooksDontMatchShape {
	FailureDefinitionId^ get ();
}
static member RebarHooksDontMatchShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace